# Описание

Написать программу, в которой два игрока по очереди бросают игральные кубики. Проводится три раунда, в каждом из которых осуществляются броски, отображаются результаты и объявляется победитель. 

Между первым и вторым раундом отображается рекламное сообщение, между вторым и третьим раундом необходимо вывести "Музыкальная пауза".

В конце программы отображается информация об общем результате игры (кто выиграл по результатам 3-х раундов)

Известно, что количество кубиков, которые бросают игроки, может в дальнейшем измениться (будут бросать по два, по три кубика и т.д.). Имена игроков будут запрашиваться у пользователя или выбираться случайным образом.

_Пример работы программы:_

```
Ваня бросает кубик, выпало 2
Петя бросает кубик, выпало 2
Ничья

~~~
Яндекс - найдётся всё
~~~

Петя бросает кубик, выпало 3
Ваня бросает кубик, выпало 6
Победитель раунда: Ваня

@ Музыкальная Пауза @ Играет музыка...

Петя бросает кубик, выпало 3
Ваня бросает кубик, выпало 4
Победитель раунда: Ваня

Все раунды сыграны. Победитель игры:
Ваня
```

# Выполнение

## Этап 1 - Раунд
Каждый бросок кубика - это случайное число от 1 до 6. Воспользуемся функцией `randint` (random integer) из модуля `random` стандартной библиотеки Python. Переменной `player1` присвоим результат вызова функции `randint(1, 6)`
```python
from random import randint

player1 = randint(1, 6)
print(f"Петя бросает кубик, выпало {player1}")
```
Аналогично реализуем бросок второго игрока:
```python
player2 = randint(1, 6)
print(f"Ваня бросает кубик, выпало {player2}")
```
Сравниваем полученные результаты и выводим результат раунда:
```python
if player1 > player2:
    print("Победитель раунда: Петя")
elif player2 > player1:
    print("Победитель раунда: Ваня")
else:
    print("Ничья")
```
Таким образом, весь код для проведения раунда игры выглядит следующим образом:
```python
from random import randint

player1 = randint(1, 6)
print(f"Петя бросает кубик, выпало {player1}")

player2 = randint(1, 6)
print(f"Ваня бросает кубик, выпало {player2}")

if player1 > player2:
    print("Победитель раунда: Петя")
elif player2 > player1:
    print("Победитель раунда: Ваня")
else:
    print("Ничья")
```

# Этап 2 - объявление функций

По заданию необходимо сыграть 3 раунда, но не подряд (между раундами отображается реклама или происходит что-то еще). 

Можно скопировать 3 раза код, отвечающий за проведение раунда, но это будет нарушением принципа DRY (_Don't Repeat Yourself_). Вносить изменения в проведение раунда понадобится в 3-х местах (везде, где код был скопирован), код программы будет занимать много строк, такой код неудобно читать и редактировать.

Цикл `for` использовать не получится, так как цикл позволяет выполнить серию команд _подряд_ некоторое число раз. В нашем случае общий план работы программы выглядит так:
* играем раунд
* что-то происходит
* играем раунд
* что-то происходит
* играем раунд
* подводим итоги игры

То есть один и тот же блок кода должен быть выполнен в начале, в середине и в конце программы. Приходим к необходимости использовать функции. 

Напишем первый вариант функции `play_round` (сыграть раунд). Поместим в её тело весь код программы (кроме строки, где импортируется `randint`). 
```python
def play_round():
    player1 = randint(1, 6)
    print(f"Петя бросает кубик, выпало {player1}")

    player2 = randint(1, 6)
    print(f"Ваня бросает кубик, выпало {player2}")

    if player1 > player2:
        print("Победитель раунда: Петя")
    elif player2 > player1:
        print("Победитель раунда: Ваня")
    else:
        print("Ничья")
```
Вызывая эту функцию, мы сможем реализовывать в программе проведение раунда. Но есть несколько проблем:
* нет возможности изменить имена игроков (всегда `Петя` и `Ваня`)
* результат раунда отображается пользователю, но его нельзя использовать в основной программе (для подведения итогов всей игры)
* функция выполняет несколько задач вместо одной (броски и выявление победителя)
