* "Перевернуть" число
* Проверить, является ли число палиндромом

Написать программу, которая определяет, является ли введенное натуральное число палиндромом (читается одинаково как справа налево, так и слева направо)

Выводится сообщение `ДА` (является палиндромом) или `НЕТ` (не является палиндромом)

_Пример 1_:

```
Введите число: 1558
НЕТ
```
_Пример 2_:

```
Введите число: 8558
ДА
```
_Вариант решения:_

```python
num = int(input("Введите число: "))

reversed_num = 0
temp_num = num

while temp_num > 0:
    reversed_num = reversed_num * 10 + temp_num % 10
    temp_num //= 10

if num == reversed_num:
    print("ДА")
else:
    print("НЕТ")
```
