> Алгоритм определения, является ли заданное пользователем целое
положительное число простым

Необходимо написать программу, которая определяет, является ли введенное пользователем целое положительное число простым - то есть **имеет только два делителя - единицу и само введенное число**

Пример 1

```
Введите число: 7
Является простым
```

Пример 2

``` 
Введите число: 8
НЕ является простым
```

Возьмем за основу решение задачи для поиска делителей любого целого положительного числа. Будет выполнять подсчет найденных делителей. Если их окажется больше двух - заданное число не является простым.

```python
# Запрашиваем исходное число
number = int(input("Введите целое положительное число: "))

total = 0  # "счетчик" для учета делителей

# В цикле for проверяем все числа от 1 до исходного
# (делится ли исходное число на очередное без остатка)
for i in range(1, number + 1):
    if number % i == 0:
        total += 1  # если делится, учитываем в total

if total > 2:  # выводим результат в зависимости от кол-ва делителей
    print("НЕ является простым")
else:
    print("Является простым")
```