> Проверить, что все цифры в записи числа являются одинаковыми

Написать программу, которая определяет, все ли цифры в записи числа являются одинаковыми.

Выводится сообщение `ДА` (все цифры одинаковые) или `НЕТ` (не все цифры одинаковые)

_Пример 1_:

```
Введите число: 155151
НЕТ
```
_Пример 2_:

```
Введите число: 5555
ДА
```
_Вариант решения:_

```python
num = int(input("Введите число: "))

same = True
last_digit = num % 10

while num > 0:
    current = num % 10
    if current != last_digit:
        same = False
    num //= 10

if same:
    print("ДА")
else:
    print("НЕТ")
```