> Алгоритм поиска всех делителей произвольного целого положительного
числа

Необходимо написать программу, которая для заданного целого положительного числа выводит все его делители (числа, на которые исходное число делится без остатка)

Пример:
```
Введите целое положительное число: 10
Делители числа 10
1
2
5
10
```

```python
# Запрашиваем исходное число
number = int(input("Введите целое положительное число: "))

print("Делители числа", number)

# В цикле for проверяем все числа от 1 до исходного
# (делится ли исходное число на очередное без остатка)
for i in range(1, number + 1):
    if number % i == 0:
        print(i)  # если делится, выводим на экран
```
