> Алгоритм нахождения минимального (максимального) числа
произвольной последовательности чисел

Существует два варианта подобных заданий (по способу ввода исходной последовательности чисел):

## Пример варианта 1 
_(вводится количество чисел, затем сами числа)_

Напишите программу, которая определяет максимальное число в последовательности вводимых пользователем целых чисел. Программа получает на вход **количество чисел в последовательности, а затем сами числа**. Программа должна вывести одно число  — максимальное из введенных.

```
Ввод:
3
-5
10
7

Вывод:
10
```

Решение:
```python
# Запрашиваем количество чисел
n = int(input())

# Запрашиваем первое число и "назначаем" его максимальным
max_value = int(input())

# Используя цикл for запрашиваем остальные числа
for i in range(n-1):
    number = int(input())
    # Сравниваем c текущим максимальным значением и обновляем при необходимости
    if number > max_value:
        max_value = number

# Выводим максимальное значение
print(max_value)
```

## Пример варианта 2
_(числа запрашиваются у пользователя, пока не введено число `0` - признак окончания ввода)_

Напишите программу, которая в последовательности целых чисел определяет максимальное. Программа получает на вход целые числа, **количество введенных чисел неизвестно, последовательность чисел заканчивается числом `0` (`0` — признак окончания ввода, не входит в последовательность)**. Программа должна вывести одно число  — максимальное из введенных.

Пример 1
```
Ввод:
-5
10
7
0

Вывод:
10
```

Пример 2
```
Ввод:
-127
-30
-52
0

Вывод:
-30
```

Решение:
```python
# Запрашиваем первое число
number = int(input())

# "Назначаем" первое число максимальным
maximum = number

while number != 0:
    # для каждого очередного числа проверяем, не больше
    # ли текущего максимума, обновляем maximum, если нужно
    if number > maximum:
        maximum = number

    # запрашиваем очередное число
    # при вводе нуля произойдет выход из цикла
    number = int(input())

# Выводим максимум
print(maximum)
```
