> Определить, встречаются ли в последовательности числа с разными знаками

Написать программу, которая запрашивает у пользователя целые числа (положительные или отрицательные), затем определяет, происходила ли в последовательности смена знака.  

Каждое число вводится на отдельной строке, признаком окончания ввода является `0`

_Пример 1:_

Ввод:
```
7
8
-2
5
0
```

Вывод:
```
ДА
```

 _Пример 2:_

Ввод:
 ```
 -7
 -8
 -2
 -5
 0
 ```
 Вывод:
 ```
 НЕТ
 ```

 _Вариант решения:_

 ```python
changed = False

prev = int(input())
num = int(input())

while num != 0:
    if prev * num < 0:  # произведение отрицательное, если знаки разные
        changed = True
    
    prev = num
    num = int(input())

if changed:
    print("ДА")
else:
    print("НЕТ")
 ```
