> Найти элемент последовательности, наиболее близкий к заданному числу

Написать программу, которая:
1. Запрашивает у пользователя целое число N (положительное и отрицательное)
2. Запрашивает последовательность целых чисел (положительных или отрицательных), каждое число на отдельной строке (`0` - признак окончания ввода)
3. Выводит число из последовательности, наиболее близкое числу N по значению (которое находится на числовой прямой ближе других к N). Если в последовательности содержится 2 таких числа, нужно вывести то, что встречается позже


_Пример 1:_

Ввод:
```
7
8
-2
5
-10
0
```

Вывод:
```
8
```

В примере выше выводится `8`, т.к. этот элемент последовательности ближе всех по значению к введенному числу `7`

---

 _Пример 2:_

Ввод:
 ```
 -5
 -4
 10
 -6
 0
 ```
 Вывод:
 ```
 -6
 ```

В примере выше выводится `-6`, т.к. этот элемент последовательности ближе всех по значению к введенному числу `-5` (наряду с числом `-4`, но элемент `-5` встретился в последовательности позже)

 _Вариант решения:_

 ```python
n = int(input())

current = int(input())

min_diff = abs(n - current)
min_number = current 

while current != 0:
    diff = abs(n - current)
    if diff < min_diff:
        min_diff = diff
        min_number = current
    current = int(input())

print(min_number)
 ```